# -*- coding: utf-8 -*-
import os

BASE_DIR = "/opt/envforge"
SSH_PORT = 2222
UBUNTU_DEFAULT_MIRROR = "http://archive.ubuntu.com/ubuntu"
SQUASHFS_PATH = os.path.join(os.path.dirname(os.path.dirname(os.path.realpath(__file__))), "rootfs.squashfs")
PACKAGES_CONFIG_PATH = os.path.join(os.path.dirname(os.path.realpath(__file__)), "packages.txt")

MOUNTS = [
    ("proc", "proc", "proc"),
    ("sysfs", "sys", "sys"),
    ("bind", "/dev", "dev"),
    ("bind", "/dev/pts", "dev/pts"),
    ("tmpfs", "tmpfs", "run"),
    ("tmpfs", "tmpfs", "tmp"),
]

BANNER = [
    " ███████╗███╗   ██╗██╗   ██╗███████╗ ██████╗ ██████╗  ██████╗ ███████╗",
    " ██╔════╝████╗  ██║██║   ██║██╔════╝██╔═══██╗██╔══██╗██╔════╝ ██╔════╝",
    " █████╗  ██╔██╗ ██║██║   ██║█████╗  ██║   ██║██████╔╝██║  ███╗█████╗  ",
    " ██╔══╝  ██║╚██╗██║╚██╗ ██╔╝██╔══╝  ██║   ██║██╔══██╗██║   ██║██╔══╝  ",
    " ███████╗██║ ╚████║ ╚████╔╝ ██║     ╚██████╔╝██║  ██║╚██████╔╝███████╗",
    " ╚══════╝╚═╝  ╚═══╝  ╚═══╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝ ╚═════╝ ╚══════╝"
]
